app/controllers/backpack_reminders_controller.rb

SELECT * FROM `account_users` WHERE (`account_users`.`account_id` = 4 AND `account_users`.`user_id` = 7) LIMIT 1
---
  def index
    @account_user = AccountUser.find(:first, :conditions => {:user_id => current_user, :account_id => current_account})