app/controllers/users_controller.rb

SELECT * FROM `account_users` WHERE (`account_users`.user_id = 7) LIMIT 1
SELECT * FROM `users` WHERE (`users`.`email` = 'dlredden') LIMIT 1
---
  def login()
    flash[:notice] = nil
    if (session[:user_id] != nil)
      redirect_to(:controller => 'reminders')
    elsif (params[:email] && params[:password])
      @found_user = User.authenticate(params[:email], params[:password])

      if (@found_user)
        session[:user_id] = @found_user.id
        session[:account_id] = @found_user.account_users.first().account_id

SELECT * FROM `plans` WHERE (`plans`.`active` = 1) ORDER BY price DESC
---
  def signup()
    build_cc_dropdown_arrays()
    @user = User.new()
    @account = Account.new()
    @payment = Payment.new()
    @account_user = AccountUser.new()
    @plans = Plan.find(:all, :order => "price DESC", :conditions => {:active => true, })

SELECT * FROM `users` WHERE (`users`.`email` = 'dl@wikidlabs.com') LIMIT 1
---
  def reset_password
    flash[:notice] = nil

    if (params[:email] == nil)
      flash[:notice] = "Please supply a valid email address"
    elsif (params[:email] !~ /\A([^@\s]+)@((?:[-a-z0-9]+\.)+[a-z]{2,})\Z/io)
      flash[:notice] = "Please supply a valid email address"
    else
      @user = User.find_by_email(params[:email])